Curso_CFD_OS/wigley/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

L	0.5; // Eslora
B       0.1; // Manga (total)
T       0.1025; // Puntal

Lx0	#calc " - $L / 2.0 -  $L  ";
Lx1	#calc "   $L / 2.0 + 4.0 * $L  ";
Ly0	0.0;
Ly1	#calc " $B / 2.0 + 3.0 * $B / 2.0 ";
Lz0	#calc " - $T - 2.0 * $T  ";
Lz1	#calc "  $T / 2.0 ";

vertices
(
    ( $Lx0    $Ly0   $Lz0)
    ( $Lx1    $Ly0   $Lz0)
    ( $Lx1    $Ly1   $Lz0)
    ( $Lx0    $Ly1   $Lz0)
    ( $Lx0    $Ly0   $Lz1)
    ( $Lx1    $Ly0   $Lz1)
    ( $Lx1    $Ly1   $Lz1)
    ( $Lx0    $Ly1   $Lz1)
 );


// Resolution

dx   0.01;

nx	#calc "int( ($Lx1 - $Lx0)  / $dx)";
ny	#calc "int( ($Ly1 - $Ly0)  / $dx)";
nz	#calc "int( ($Lz1 - $Lz0)  / $dx)";


blocks
(
 hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    midPlane
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
        );
    }
    side
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
